<?php include "defolthead.php" ?>

<div class="content">
	<h2>Bellissimo - это ВКУСНО!</h2>
	<p>Традиционная кухня Италии, распространённая и популярная во всём мире, благодаря таким блюдам, как пицца и спагетти. Она очень разнообразна и региональна, в каждом регионе есть свои традиционные блюда. В основе итальянской кухни лежат исторически сложившиеся многовековые традиции с культурными влияниями римлян, греков, лангобардов, арабов, и прочих народов, когда-либо населявших Италию или оказывавших влияние на формирование её культуры</p>
	<p>Именно в кафе Bellissimo вы  можете прочувствоть вкус Италии. Вас порадует наша атмосфера, изумительные блюда и напитки, после которых вы ещё долго будете ощущать послевкусие. </p>
	<tr>
		<a href="image/альбом1.jpg" target="_blank"> <img src="image/альбом1.jpg" width="270" height="220" style=" margin: 20px 5px 20px 5px"> </a>
		<a href="image/альбом 2.jpg" target="_blank"> <img src="image/альбом 2.jpg" width="270" height="220" style=" margin: 20px 5px 20px 5px"> </a>
		<a href="image/альбом 3.jpg" target="_blank"> <img src="image/альбом 3.jpg" width="270" height="220" style=" margin: 20px 5px 20px 5px"> </a>
	</tr>
</div> 

<?php include "defoltfooter.php" ?>
